app/Http/Controllers/Api/User/CheckoutController.php

    public function preview(CheckoutPreviewRequest $request): JsonResponse
    {
        $validated = $request->validated();

        $paymentService = app(\App\Services\Payment\PaymentService::class);

        $quantity = (int) ($validated['quantity'] ?? 1);

        // Load product and selected price context
        $product = null;
        $selectedPrice = null;

        if (! empty($validated['product_price_id'])) {
            $selectedPrice = \App\Models\ProductPrice::with('product')->active()->findOrFail($validated['product_price_id']);
---
select * from "products" where "products"."id" in ('01KBB0ESRCQH9BY3MYCCF2J61W') and "products"."deleted_at" is null