database/factories/OrderFactory.php

insert into "product_prices" ("id", "product_id", "title", "slug", "amount", "currency", "billing_period", "trial_days", "gateway_data", "is_active", "updated_at", "created_at") values ('01KDD3KR2A4GFMXNR24CFR8671', '01KDD3KR2DWNABJTMV1M4JSG8B', 'Basic', 'perspiciatis-consequatur-autem-quis-quis-odit-vero', 632.14, 'GBP', 'once', 0, '{"stripe":{"price_id":"price_Ee4FJT15bTR61ea6O1GAknB2"},"paypal":{"plan_id":"P-O2TUJY7YUMLMREJC9"}}', 1, '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "products" ("id", "title", "slug", "description", "type", "image", "file", "is_active", "meta", "updated_at", "created_at") values ('01KDD3KR2DWNABJTMV1M4JSG8B', 'iusto commodi sunt', 'iusto-commodi-sunt', 'Aut quisquam qui rerum voluptates. Excepturi tempora ex laboriosam. Alias sunt aut facere qui porro.', 'digital', 'https://via.placeholder.com/640x480.png/00dd99?text=products+expedita', null, 1, '{"features":["sit","inventore","magni","suscipit","sed"],"category":"ut"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
---
    public function definition(): array
    {
        $productPrice = ProductPrice::factory()->create();