database/factories/SubscriptionFactory.php

insert into "product_prices" ("id", "product_id", "title", "slug", "amount", "currency", "billing_period", "trial_days", "gateway_data", "is_active", "updated_at", "created_at") values ('01KDD3KR2MJ95SFQCZMW4K2PNS', '01KDD3KR2NJNNW2HSDWTXN9PHF', 'Standard', 'nobis-inventore-maxime-nam-explicabo-reiciendis-sed-quam-omnis', 484.06, 'EUR', 'monthly', 7, '{"stripe":{"price_id":"price_9jw1s6rKkvDNb4Nmyq13qUED"},"paypal":{"plan_id":"P-MYCINLHHDOKPL2MAY"}}', 1, '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "products" ("id", "title", "slug", "description", "type", "image", "file", "is_active", "meta", "updated_at", "created_at") values ('01KDD3KR2NJNNW2HSDWTXN9PHF', 'quo beatae non', 'quo-beatae-non', 'Et quasi explicabo deleniti et. Excepturi corrupti eius sed excepturi eum. Assumenda veritatis molestiae amet at debitis velit.', 'subscription', 'https://via.placeholder.com/640x480.png/00dd77?text=products+qui', 'https://www.kunze.com/et-sequi-nemo-exercitationem-libero-quo-ut-exercitationem', 1, '{"features":["enim","beatae","ad","aut","cumque"],"category":"a"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
---
    public function definition(): array
    {
        $productPrice = ProductPrice::factory()->monthly()->create();