database/factories/TransactionFactory.php

    public function definition(): array
    {
        $types = ['payment', 'refund', 'subscription_payment', 'subscription_refund'];
        $type = $this->faker->randomElement($types);
        $amount = $this->faker->randomFloat(2, 1, 1000);

        // Create order first to get user_id
        $order = Order::factory()->create();

        return [
            'user_id' => $order->user_id,
            'order_id' => $order->id,
            'subscription_id' => $type === 'subscription_payment' || $type === 'subscription_refund'
                ? Subscription::factory()->create(['user_id' => $order->user_id])->id
---
insert into "orders" ("user_id", "product_id", "product_price_id", "order_number", "status", "total", "currency", "tax", "billing_email", "billing_name", "billing_address", "billing_city", "billing_state", "billing_zipcode", "billing_country", "gateway", "gateway_order_id", "gateway_data", "customer_note", "quantity", "meta", "updated_at", "created_at") values ('01KDD3KR2KMHZR3BS377YH472S', '01KDD3KR2HSG91AF753ZDJWNK0', '01KDD3KR2HSG91AF753ZDJWNJZ', 'ORD-17440584', 'completed', 399.08, 'USD', 29.06, 'janis40@example.com', 'Walton Upton Jr.', '7187 Alberto Shoals Apt. 504', 'Fritschview', 'Florida', '65961', 'GQ', 'paypal', 'qhdLdBLR1CYJhUy2kztV', '{"session_id":"lsTCxB7iea9JTLgMQdoiOz38uWlOXwUxSKPrRvJVPLQphz6fyX","payment_intent":"OH05vfPeFW68TFZGhsLbzHC043z"}', null, 3, '{"source":"api","referrer":"http:\/\/www.heaney.com\/laboriosam-quos-vitae-accusantium-laborum-asperiores-quidem-vero-repellat.html"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "orders" ("user_id", "product_id", "product_price_id", "order_number", "status", "total", "currency", "tax", "billing_email", "billing_name", "billing_address", "billing_city", "billing_state", "billing_zipcode", "billing_country", "gateway", "gateway_order_id", "gateway_data", "customer_note", "quantity", "meta", "updated_at", "created_at") values ('01KDD3KR2RJMZXET5YS92AHX6N', '01KDD3KR2P5XX3DYNVY526QRQC', '01KDD3KR2P5XX3DYNVY526QRQB', 'ORD-25995889', 'failed', 252.79, 'USD', 28.78, 'gkiehn@example.net', 'Mr. Furman Waelchi', '9457 Rasheed Harbor Suite 454', 'Deckowshire', 'Utah', '48277', 'EH', 'paypal', 'FqrjXretXPLQQyr6686r', '{"session_id":"aGihkOCtfAh5dHlcS72P5Vjc62xNVRnOMysFnVOCt86e4PmsOR","payment_intent":"hzeihixMY5WpSkT8Q56O1UvKAfy"}', 'Veniam illo et deserunt culpa enim a.', 2, '{"source":"api","referrer":"http:\/\/williamson.com\/eveniet-sit-voluptatem-corrupti-vitae-aut-voluptatem.html"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "subscriptions" ("user_id", "product_id", "product_price_id", "order_id", "title", "status", "gateway", "gateway_subscription_id", "gateway_status", "gateway_data", "trial_ends_at", "ends_at", "next_billing_date", "canceled_at", "updated_at", "created_at") values ('01KDD3KR2KMHZR3BS377YH472S', '01KDD3KR2NJNNW2HSDWTXN9PHF', '01KDD3KR2MJ95SFQCZMW4K2PNS', 10, 'illo repellat placeat', 'incomplete', 'paypal', 'fE7jtfUdbmpzetHrDL27', 'active', '{"customer_id":"jKSaX7SH5cTJkWpRUF","latest_invoice":"9bLTvMPg3mQXhB1IIQw3AbOK6qI"}', null, null, '2026-02-25 21:00:13', null, '2025-12-26 10:35:01', '2025-12-26 10:35:01')