app/Services/Settings/SettingsManager.php

    public function get(string $key, mixed $default = null): mixed
    {
        return Cache::remember("setting:{$key}", 3600, function () use ($key, $default) {
            [$group, $settingKey] = $this->parseKey($key);

            $setting = Setting::where('group', $group)
                ->where('key', $settingKey)
                ->first();
---
select * from "settings" where "group" = 'google' and "key" = 'enabled' limit 1

    public function getByGroup(string $group): array
    {
        return Setting::where('group', $group)
            ->get()
            ->mapWithKeys(function ($setting) {
                return [$setting->key => $this->castValue($setting)];
            })
            ->toArray();
---
select * from "settings" where "group" = 'app'