app/Filament/Widgets/DashboardStatsOverview.php

    protected function getStats(): array
    {
        // Revenue metrics
        $totalRevenue = Transaction::where('status', 'completed')->sum('amount');
        $thisMonthRevenue = Transaction::where('status', 'completed')
            ->whereBetween('created_at', [now()->startOfMonth(), now()->endOfMonth()])
            ->sum('amount');
        $lastMonthRevenue = Transaction::where('status', 'completed')
            ->whereBetween('created_at', [
                now()->subMonth()->startOfMonth(),
                now()->subMonth()->endOfMonth(),
            ])
            ->sum('amount');

        // Customer metrics
        $totalCustomers = User::count();
        $newCustomersThisMonth = User::whereBetween('created_at', [
            now()->startOfMonth(),
            now()->endOfMonth(),
        ])->count();
        $activeSubscribers = Subscription::where('status', 'active')->count();

        // MRR calculation
        $currentMRR = Subscription::where('status', 'active')
            ->with('productPrice')
            ->get()
            ->sum(function ($subscription) {
                return $subscription->productPrice ? $subscription->productPrice->amount : 0;
            });

        // Orders
        $totalOrders = Order::count();
---
select sum("amount") as aggregate from "transactions" where "status" = 'completed'
select sum("amount") as aggregate from "transactions" where "status" = 'completed' and "created_at" between '2025-12-01 00:00:00' and '2025-12-31 23:59:59'
select sum("amount") as aggregate from "transactions" where "status" = 'completed' and "created_at" between '2025-11-01 00:00:00' and '2025-11-30 23:59:59'
select count(*) as aggregate from "users"
select count(*) as aggregate from "users" where "created_at" between '2025-12-01 00:00:00' and '2025-12-31 23:59:59'
select count(*) as aggregate from "subscriptions" where "status" = 'active'
select * from "product_prices" where "product_prices"."id" in ('01KBB0E29F27VS03KR5BRF3KXV', '01KBB0ESRKETG8SPEG5QPWNNHD') and "product_prices"."deleted_at" is null
select * from "subscriptions" where "status" = 'active'
select count(*) as aggregate from "orders" where "orders"."deleted_at" is null