app/Http/Controllers/AccountModalsDemoController.php

    public function index(): View
    {
        // Get or create a demo user with data
        $user = User::where('email', 'demo@paycan.test')->first();

        if (! $user) {
            $user = User::factory()->create([
                'name' => 'Demo User',
                'email' => 'demo@paycan.test',
            ]);
        }

        // Create demo data if user has no orders
        if ($user->orders()->count() === 0) {
---
select * from "users" where "email" = 'demo@paycan.test' limit 1
insert into "users" ("id", "name", "email", "email_verified_at", "password", "remember_token", "updated_at", "created_at") values ('01KDD3KQW8D7WRD69B5N37A749', 'Demo User', 'demo@paycan.test', '2025-12-26 10:35:00', '$2y$12$zPc30MPejabBVPC4.3mi5.tJucoIrdJ9kwgumpUSsP3bHnx30x8C2', 'hkbFxkBpDf', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
select count(*) as aggregate from "orders" where "orders"."user_id" = '01KDD3KQW8D7WRD69B5N37A749' and "orders"."user_id" is not null and "orders"."deleted_at" is null

    private function seedDemoData(User $user): void
    {
        // Get or create demo products
        $products = Product::active()->take(3)->get();

        if ($products->isEmpty()) {
            // If no products exist, just return - user should create them in admin
            return;
        }

        // Create a few completed orders
        foreach ($products->take(2) as $product) {
            $price = $product->prices()->active()->first();
            if (! $price) {
                continue;
            }

            $order = Order::factory()->create([
                'user_id' => $user->id,
                'product_id' => $product->id,
                'product_price_id' => $price->id,
                'status' => 'completed',
                'gateway' => fake()->randomElement(['stripe', 'paypal']),
                'total' => $price->amount,
                'currency' => $price->currency,
            ]);

            // Create a transaction for the order
            Transaction::factory()->create([
                'user_id' => $user->id,
                'order_id' => $order->id,
                'status' => 'succeeded',
                'amount' => $price->amount,
                'currency' => $price->currency,
                'gateway' => $order->gateway,
                'type' => 'payment',
            ]);
---
insert into "orders" ("user_id", "product_id", "product_price_id", "order_number", "status", "total", "currency", "tax", "billing_email", "billing_name", "billing_address", "billing_city", "billing_state", "billing_zipcode", "billing_country", "gateway", "gateway_order_id", "gateway_data", "customer_note", "quantity", "meta", "updated_at", "created_at") values ('01KDD3KQW8D7WRD69B5N37A749', '01KBB0D4CQWNX6E0R6QQS72GCK', '01KBB0E29F27VS03KR5BRF3KXV', 'ORD-93490916', 'completed', '10.00', 'USD', 5.35, 'rupert.koss@example.net', 'Patrick Price PhD', '927 Gulgowski Trafficway', 'South Marielleton', 'Ohio', '85799-3566', 'OM', 'stripe', '2f1WBbqPHzlMheYuUhqk', '{"session_id":"bgWjsTjvvKT7OjZGbndes4BzybYFGgXzOMlyJhykOhnP9zp1dW","payment_intent":"ZtNdVtgBpIxpQeb2ZjbeGXb2lw5"}', 'Vel officiis adipisci quia officiis vitae ea alias.', 4, '{"source":"web","referrer":null}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "transactions" ("user_id", "order_id", "subscription_id", "type", "status", "amount", "currency", "gateway", "gateway_transaction_id", "gateway_data", "updated_at", "created_at") values ('01KDD3KQW8D7WRD69B5N37A749', 8, 4, 'payment', 'succeeded', '10.00', 'USD', 'stripe', 'txn_11il55rr19ae64ej', '{"payment_method":"paypal","last_four":"5528","brand":"mastercard"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')

            ->first()?->prices->first();

        if ($recurringPrice) {
            $subscription = Subscription::factory()->create([
                'user_id' => $user->id,
                'product_id' => $recurringPrice->product_id,
                'product_price_id' => $recurringPrice->id,
                'status' => 'active',
                'gateway' => 'stripe',
                'next_billing_date' => now()->addMonth(),
            ]);

            // Create a transaction for the subscription
            Transaction::factory()->create([
                'user_id' => $user->id,
                'subscription_id' => $subscription->id,
                'status' => 'succeeded',
                'amount' => $recurringPrice->amount,
                'currency' => $recurringPrice->currency,
                'gateway' => 'stripe',
                'type' => 'subscription',
            ]);
---
insert into "subscriptions" ("user_id", "product_id", "product_price_id", "order_id", "title", "status", "gateway", "gateway_subscription_id", "gateway_status", "gateway_data", "trial_ends_at", "ends_at", "next_billing_date", "canceled_at", "updated_at", "created_at") values ('01KDD3KQW8D7WRD69B5N37A749', '01KBB0ESRKETG8SPEG5QPWNNHE', '01KBB0ESRKETG8SPEG5QPWNNHD', 13, 'iusto est ratione', 'active', 'stripe', 'VQwEqiIliQCLRtXL0rcy', 'active', '{"customer_id":"E91JCSE7b0kzy7Ns7e","latest_invoice":"hQigP3b5I38pMuikaM3XDAe8ItW"}', null, null, '2026-01-26 10:35:01', null, '2025-12-26 10:35:01', '2025-12-26 10:35:01')
insert into "transactions" ("user_id", "order_id", "subscription_id", "type", "status", "amount", "currency", "gateway", "gateway_transaction_id", "gateway_data", "updated_at", "created_at") values ('01KDD3KQW8D7WRD69B5N37A749', 14, 5, 'subscription', 'succeeded', '610.61', 'GBP', 'stripe', 'txn_45sv75th67zb22uj', '{"payment_method":"bank_transfer","last_four":"2540","brand":"visa"}', '2025-12-26 10:35:01', '2025-12-26 10:35:01')