app/Http/Controllers/CheckoutPageDemoController.php

    public function index(): RedirectResponse
    {
        // Get or create a demo user
        $user = User::firstOr(function () {
            return User::factory()->create([
                'name' => 'Demo User',
                'email' => 'demo@paycan.test',
            ]);
        });
---
select * from "users" limit 1