app/Filament/Pages/WebComponentsDemo.php

    protected function getOrCreateDemoUser(): User
    {
        // Find existing demo user by checking for users with emails starting with 'demo-'
        $demoUser = User::where('email', 'like', 'demo-%@paycan.test')
            ->where('name', 'Web Components Demo User')
            ->first();
---
select * from "users" where "email" like 'demo-%@paycan.test' and "name" = 'Web Components Demo User' limit 1

    protected function seedDemoDataIfNeeded(): void
    {
        // Check if user already has orders
        if ($this->demoUser->orders()->count() > 0) {
---
select count(*) as aggregate from "orders" where "orders"."user_id" = '01KBB0ESJ9VKPRXTE1RPVJ2JT5' and "orders"."user_id" is not null and "orders"."deleted_at" is null

    protected function getSampleProductAndPrice(): void
    {
        $product = \App\Models\Product::where('is_active', true)
            ->whereHas('prices', function ($query) {
                $query->where('is_active', true);
            })
            ->with('prices')
            ->first();
---
select * from "products" where "is_active" = 1 and exists (select * from "product_prices" where "products"."id" = "product_prices"."product_id" and "is_active" = 1 and "product_prices"."deleted_at" is null) and "products"."deleted_at" is null limit 1